wangben85/nRF52832_SDK_16.0_Ben/examples/ble_peripheral/ble_app_uart_multi_master/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
    // Initialize.
    uart_init(); //uart init
    log_init(); //RTT LOG enabled
    timers_init();
   
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();//sd_ble_gap_ppcp_set,Set GAP Peripheral Preferred Connection Parameters.
    gatt_init();//nrf_ble_gatt_att_mtu_periph_set, set GATT MTU size 
    services_init(); // Initialize NUS services and characteristics
    advertising_init();//adv configuration, including APP_ADV_INTERVAL and APP_ADV_DURATION, etc.
    
    // all options and data needed for initialization of the connection parameters negotiation module. 
    conn_params_init();
    // Start execution.
    NRF_LOG_INFO("BLE UART peripheral wit multiple master example started.");
    NRF_LOG_INFO("Software version is 0x02");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}
